# Top 5 countries with the sharpest decline in birth rates since 2019

## Importing the data

In [1]:
import pandas as pd

# Import data to dataframe
df = pd.read_csv('data/fertility_global_wide-raw.csv')

## Analysis of dataset shape

In [2]:
# Datasets sourced from World Bank often have many metadata columns
print(df.shape)
print(df.columns[:10])
df.head()

(265, 105)
Index(['STRUCTURE', 'STRUCTURE_ID', 'ACTION', 'FREQ', 'REF_AREA', 'INDICATOR',
       'SEX', 'AGE', 'URBANISATION', 'UNIT_MEASURE'],
      dtype='str')

,STRUCTURE,STRUCTURE_ID,ACTION,FREQ,REF_AREA,INDICATOR,SEX,AGE,URBANISATION,UNIT_MEASURE,...,2014,2015,2016,2017,2018,2019,2020,2021,2022,2023
0,datastructure,WB.DATA360:DS_DATA360(1.3),I,A,TCA,WB_WDI_SP_DYN_TFRT_IN,_T,_T,_T,BR_W,...,1.7290,1.7180,1.7130,1.7040,1.6770,1.6170,1.5520,1.501,1.4770,1.4630
1,datastructure,WB.DATA360:DS_DATA360(1.3),I,A,FRO,WB_WDI_SP_DYN_TFRT_IN,_T,_T,_T,BR_W,...,2.5767,2.4278,2.6393,2.4926,2.5118,2.4341,2.3498,2.325,2.0713,1.8586
2,datastructure,WB.DATA360:DS_DATA360(1.3),I,A,ALB,WB_WDI_SP_DYN_TFRT_IN,_T,_T,_T,BR_W,...,1.7210,1.6310,1.5550,1.4860,1.4150,1.3950,1.3710,1.365,1.3550,1.3480
3,datastructure,WB.DATA360:DS_DATA360(1.3),I,A,SGP,WB_WDI_SP_DYN_TFRT_IN,_T,_T,_T,BR_W,...,1.2500,1.2400,1.2000,1.1600,1.1400,1.1400,1.1000,1.120,1.0400,0.9700
4,datastructure,WB.DATA360:DS_DATA360(1.3),I,A,BOL,WB_WDI_SP_DYN_TFRT_IN,_T,_T,_T,BR_W,...,2.9470,2.8860,2.8290,2.7770,2.7300,2.6880,2.6510,2.618,2.5840,2.5470

In [3]:
df.info(verbose=True)

<class 'pandas.DataFrame'>
RangeIndex: 265 entries, 0 to 264
Data columns (total 105 columns):
 #    Column                  Dtype
---   ------                  -----
 0    STRUCTURE               str
 1    STRUCTURE_ID            str
 2    ACTION                  str
 3    FREQ                    str
 4    REF_AREA                str
 5    INDICATOR               str
 6    SEX                     str
 7    AGE                     str
 8    URBANISATION            str
 9    UNIT_MEASURE            str
 10   COMP_BREAKDOWN_1        str
 11   COMP_BREAKDOWN_2        str
 12   COMP_BREAKDOWN_3        str
 13   AGG_METHOD              str
 14   UNIT_TYPE               str
 15   DECIMALS                int64
 16   DATABASE_ID             str
 17   TIME_FORMAT             str
 18   COMMENT_TS              str
 19   UNIT_MULT               int64
 20   DATA_SOURCE             str
 21   OBS_CONF                str
 22   OBS_STATUS              str
 23   FREQ_LABEL              str
 24   REF_AREA_LABEL          str
 25   INDICATOR_LABEL         str
 26   SEX_LABEL               str
 27   AGE_LABEL               str
 28   URBANISATION_LABEL      str
 29   UNIT_MEASURE_LABEL      str
 30   COMP_BREAKDOWN_1_LABEL  str
 31   COMP_BREAKDOWN_2_LABEL  str
 32   COMP_BREAKDOWN_3_LABEL  str
 33   AGG_METHOD_LABEL        str
 34   UNIT_TYPE_LABEL         str
 35   DECIMALS_LABEL          str
 36   DATABASE_ID_LABEL       str
 37   TIME_FORMAT_LABEL       str
 38   UNIT_MULT_LABEL         str
 39   OBS_STATUS_LABEL        str
 40   OBS_CONF_LABEL          str
 41   1960                    float64
 42   1961                    float64
 43   1962                    float64
 44   1963                    float64
 45   1964                    float64
 46   1965                    float64
 47   1966                    float64
 48   1967                    float64
 49   1968                    float64
 50   1969                    float64
 51   1970                    float64
 52   1971                    float64
 53   1972                    float64
 54   1973                    float64
 55   1974                    float64
 56   1975                    float64
 57   1976                    float64
 58   1977                    float64
 59   1978                    float64
 60   1979                    float64
 61   1980                    float64
 62   1981                    float64
 63   1982                    float64
 64   1983                    float64
 65   1984                    float64
 66   1985                    float64
 67   1986                    float64
 68   1987                    float64
 69   1988                    float64
 70   1989                    float64
 71   1990                    float64
 72   1991                    float64
 73   1992                    float64
 74   1993                    float64
 75   1994                    float64
 76   1995                    float64
 77   1996                    float64
 78   1997                    float64
 79   1998                    float64
 80   1999                    float64
 81   2000                    float64
 82   2001                    float64
 83   2002                    float64
 84   2003                    float64
 85   2004                    float64
 86   2005                    float64
 87   2006                    float64
 88   2007                    float64
 89   2008                    float64
 90   2009                    float64
 91   2010                    float64
 92   2011                    float64
 93   2012                    float64
 94   2013                    float64
 95   2014                    float64
 96   2015                    float64
 97   2016                    float64
 98   2017                    float64
 99   2018                    float64
 100  2019                    float64
 101  2020                    float64
 102  2021                    float64
 103  2022                    float64
 104  2023                    float64
dtypes: float64(64), int64(2), str(39)
memory usage: 217.5 KB

## Converting the dataset to long format

In [24]:
# To ensure usable data it is neccessary to convert the existing dataset to a long format
df_long = df.melt(
    id_vars=["REF_AREA_LABEL"],
    # filter the data for data from 2000 to 2023
    value_vars=[str(year) for year in range(2000, 2024)],
    var_name="Year",
    value_name="Fertility"
)
df_long['Year'] = df_long['Year'].astype(int)
df_long.head()

             REF_AREA_LABEL  Year  Fertility
0  Turks and Caicos Islands  2000     2.4060
1             Faroe Islands  2000     2.5861
2                   Albania  2000     2.2170
3                 Singapore  2000     1.6000
4                   Bolivia  2000     3.9910

In [5]:
df_long.describe()

              Year    Fertility
count  6360.000000  6360.000000
mean   2011.500000     2.834922
std       6.922731     1.456570
min    2000.000000     0.586000
25%    2005.750000     1.709880
50%    2011.500000     2.324037
75%    2017.250000     3.711250
max    2023.000000     7.829000

In [6]:
pd.isna(df_long['Year']).sum()

np.int64(0)

In [7]:
pd.isna(df_long['Fertility']).sum()

np.int64(0)

In [17]:
df_long = df_long.sort_values(by=['REF_AREA_LABEL', 'Year', 'Fertility'])
df_long.head()

     REF_AREA_LABEL  Year  Fertility
156     Afghanistan  2000      7.566
421     Afghanistan  2001      7.453
686     Afghanistan  2002      7.320
951     Afghanistan  2003      7.174
1216    Afghanistan  2004      7.018

In [25]:
start = df_long[df_long["Year"] == 2019][["REF_AREA_LABEL", "Fertility"]].copy()
end   = df_long[df_long["Year"] == 2023][["REF_AREA_LABEL", "Fertility"]].copy()

merged = start.merge(
    end,
    on="REF_AREA_LABEL",
    suffixes=("_2019", "_2023")
)

print(start.shape)
print(end.shape)

merged.head()

(265, 2)
(265, 2)

             REF_AREA_LABEL  Fertility_2019  Fertility_2023
0  Turks and Caicos Islands          1.6170          1.4630
1             Faroe Islands          2.4341          1.8586
2                   Albania          1.3950          1.3480
3                 Singapore          1.1400          0.9700
4                   Bolivia          2.6880          2.5470

In [27]:
merged["Percent_Change"] = (
    (merged["Fertility_2023"] - merged["Fertility_2019"])
    / merged["Fertility_2019"]
) * 100

merged.head()

             REF_AREA_LABEL  Fertility_2019  Fertility_2023  Percent_Change
0  Turks and Caicos Islands          1.6170          1.4630       -9.523810
1             Faroe Islands          2.4341          1.8586      -23.643236
2                   Albania          1.3950          1.3480       -3.369176
3                 Singapore          1.1400          0.9700      -14.912281
4                   Bolivia          2.6880          2.5470       -5.245536

In [28]:
decline = merged.sort_values("Percent_Change")
top5_decline = decline.head(5)

top5_decline.head()

           REF_AREA_LABEL  Fertility_2019  Fertility_2023  Percent_Change
75       Macao SAR, China           0.899           0.586      -34.816463
218                 China           1.496           0.999      -33.221925
159  Hong Kong SAR, China           1.064           0.751      -29.417293
153                Kuwait           2.082           1.524      -26.801153
47                Curaçao           1.600           1.200      -25.000000